# Exercise three

In [1]:
import pandas as pd

In [7]:
range(10)

range(0, 10)

In [8]:
for i in range(10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [1]:
def print_hello(name):
    sentence="Hello"+" "+name
    print(sentence)

In [3]:
print_hello("Sam")

Hello Sam

In [4]:
def add_10(value):
    num=value+10
    return(num)

In [5]:
add_10(100)

110

In [6]:
L1=[1,2,3]
L2=[2,4,6]

def add_list(l1,l2):

In [9]:
L=[]
for i in range(len(L1)):
    V=L1[i]+L2[i]
    L.append(V)

In [10]:
L

[3, 6, 9]

In [12]:
def add_list(l1,l2):
    L=[]
    for i in range(len(l1)):
        V=l1[i]+l2[i]
        L.append(V)
    return(L)

In [13]:
add_list(L1,L2)

[3, 6, 9]

## Dictionary

In [24]:
test1={"Monday":"Shopping",
       "Tuesday":"Reading",
       "Wednesday":"Sleeping",
       "Thursday":"Working",
       "Friday":"Reading"}

In [25]:
test1["Monday"]

'Shopping'

In [26]:
test1["Saturday"]="Sleeping"

In [27]:
test1

{'Monday': 'Shopping',
 'Tuesday': 'Reading',
 'Wednesday': 'Sleeping',
 'Thursday': 'Working',
 'Friday': 'Reading',
 'Saturday': 'Sleeping'}

In [28]:
test1["Saturday"]="Working"

In [29]:
test1

{'Monday': 'Shopping',
 'Tuesday': 'Reading',
 'Wednesday': 'Sleeping',
 'Thursday': 'Working',
 'Friday': 'Reading',
 'Saturday': 'Working'}

In [19]:
test1["Monday"]=["Shopping","Working"]

In [20]:
test1

{'Monday': ['Shopping', 'Working'],
 'Tuesday': 'Reading',
 'Wednesday': 'Sleeping',
 'Thursday': 'Working',
 'Friday': 'Reading',
 'Saturday': 'Sleeping'}

In [22]:
test1["Monday"].append("Sleeping")

In [23]:
test1

{'Monday': ['Shopping', 'Working', 'Sleeping'],
 'Tuesday': 'Reading',
 'Wednesday': 'Sleeping',
 'Thursday': 'Working',
 'Friday': 'Reading',
 'Saturday': 'Sleeping'}

In [30]:
s="abcde"

In [31]:
s[::]

'abcde'

In [32]:
s[::2]

'ace'

In [33]:
s[1:]

'bcde'

## Pandas

In [35]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])

In [36]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [37]:
S1=pd.Series([26000,300,5,170],index=["HSI","0700.HK","1398.HK","388.HK"])

In [38]:
S1

HSI        26000
0700.HK      300
1398.HK        5
388.HK       170
dtype: int64

In [39]:
S1[S1>100]

HSI        26000
0700.HK      300
388.HK       170
dtype: int64

In [40]:
S1.loc["1398.HK"]

5

In [41]:
S1.iloc[-1]

170

In [43]:
S1=S1.iloc[:-1]

In [44]:
S1

HSI        26000
0700.HK      300
1398.HK        5
dtype: int64

In [46]:
df2=pd.DataFrame({"First_Name":["Peter","Victor","Albert","Alice"],
                 "ID":[1,2,3,4],
                 "Income":[1000,20000,3000,2000],
                 },index=["A1","A2","A3","A4"])
df2

   First_Name  ID  Income
A1      Peter   1    1000
A2     Victor   2   20000
A3     Albert   3    3000
A4      Alice   4    2000

In [47]:
df2["Income"]

A1     1000
A2    20000
A3     3000
A4     2000
Name: Income, dtype: int64

In [48]:
df2["Income"]>3000

A1    False
A2     True
A3    False
A4    False
Name: Income, dtype: bool

In [49]:
df2[df2["Income"]>3000]

   First_Name  ID  Income
A2     Victor   2   20000

In [52]:
df2.loc[["A2","A4"]]

   First_Name  ID  Income
A2     Victor   2   20000
A4      Alice   4    2000

In [51]:
df2.loc["A2":"A3"]

   First_Name  ID  Income
A2     Victor   2   20000
A3     Albert   3    3000

In [53]:
df2.iloc[:-1,]

   First_Name  ID  Income
A1      Peter   1    1000
A2     Victor   2   20000
A3     Albert   3    3000

In [54]:
df2.iloc[:-1,1:]

    ID  Income
A1   1    1000
A2   2   20000
A3   3    3000

In [55]:
?pd.read_csv

In [2]:
df=pd.read_csv("HSI_June2020.csv")

In [3]:
df.shape

(4149, 6)

In [4]:
df.tail()

                     Date     Open     High      Low    Close  Volume
4144  2020-06-25 02:35:00  24512.0  24513.0  24488.0  24502.0      48
4145  2020-06-25 02:40:00  24499.0  24508.0  24478.0  24478.0      91
4146  2020-06-25 02:45:00  24481.0  24505.0  24476.0  24494.0      57
4147  2020-06-25 02:50:00  24495.0  24499.0  24479.0  24486.0     148
4148  2020-06-25 02:55:00  24488.0  24505.0  24477.0  24477.0     232

In [5]:
df.head()

                  Date     Open     High      Low    Close  Volume
0  2020-05-26 17:15:00  23152.0  23187.0  23152.0  23176.0     337
1  2020-05-26 17:20:00  23178.0  23182.0  23157.0  23162.0     155
2  2020-05-26 17:25:00  23158.0  23166.0  23150.0  23166.0      64
3  2020-05-26 17:30:00  23168.0  23175.0  23158.0  23160.0      45
4  2020-05-26 17:35:00  23162.0  23162.0  23137.0  23144.0      64

In [6]:
df.describe()

               Open          High           Low         Close        Volume
count   4149.000000   4149.000000   4149.000000   4149.000000   4149.000000
mean   24166.197156  24184.075681  24148.502531  24166.338636    790.558448
std      667.979297    666.956791    668.821926    667.884696   1069.914105
min    22456.000000  22535.000000  22389.000000  22459.000000      4.000000
25%    23798.000000  23824.000000  23778.000000  23803.000000    137.000000
50%    24324.000000  24341.000000  24308.000000  24324.000000    346.000000
75%    24667.000000  24681.000000  24652.000000  24668.000000   1047.000000
max    25246.000000  25255.000000  25189.000000  25248.000000  11132.000000

In [62]:
df[df["Close"]>24668].shape

(1036, 6)

In [64]:
(df["Close"]>24668).sum()

1036

df[XXXX]=df[YYYY]-df[uuuu]

In [65]:
df["Range"]=df["High"]-df["Low"]

In [66]:
df.tail()

                     Date     Open     High      Low    Close  Volume  Range
4144  2020-06-25 02:35:00  24512.0  24513.0  24488.0  24502.0      48   25.0
4145  2020-06-25 02:40:00  24499.0  24508.0  24478.0  24478.0      91   30.0
4146  2020-06-25 02:45:00  24481.0  24505.0  24476.0  24494.0      57   29.0
4147  2020-06-25 02:50:00  24495.0  24499.0  24479.0  24486.0     148   20.0
4148  2020-06-25 02:55:00  24488.0  24505.0  24477.0  24477.0     232   28.0

In [67]:
df["Range"].describe()

count    4149.000000
mean       35.573150
std        25.742377
min         2.000000
25%        19.000000
50%        29.000000
75%        44.000000
max       312.000000
Name: Range, dtype: float64

In [68]:
df[df["Range"]==df["Range"].max()]

                    Date     Open     High      Low    Close  Volume  Range
693  2020-06-01 09:15:00  23167.0  23478.0  23166.0  23398.0    7868  312.0

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4149 entries, 0 to 4148
Data columns (total 7 columns):
Date      4149 non-null object
Open      4149 non-null float64
High      4149 non-null float64
Low       4149 non-null float64
Close     4149 non-null float64
Volume    4149 non-null int64
Range     4149 non-null float64
dtypes: float64(5), int64(1), object(1)
memory usage: 227.0+ KB

In [72]:
df[(df["Range"]>100) & (df["Close"]>24668)].shape

(16, 7)